IDENTIFICATION DIVISION.
PROGRAM-ID. PRUEBAUNO.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.

01 NAME PIC X(10) VALUE SPACES.

PROCEDURE DIVISION.
MAIN-PROCEDURE.

PERFORM ACCEPT-NAME.
PERFORM DISPLAY-GREETING.
STOP RUN.

ACCEPT-NAME.
DISPLAY "PLEASE ENTER YOUR NAME: "
ACCEPT NAME.

DISPLAY-GREETING.
DISPLAY "HELLO WORLD " NAME.
